Тест/Тест/src/Documents/Рас_Комплектовка/Рас_Комплектовка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рас_Комплектовка</name>
  <registerRecords>AccumulationRegister.РегистрНакопления1</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.Стеллаж</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеКомплектовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </attributes>
  <attributes>
    <name>Полная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетальПродана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ПроектыРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принадлежность</name>
    <type>
      <types>EnumRef.ПринадлежностьДетали</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураСписок</name>
    <attributes>
      <name>Номенклатураспис</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>CatalogRef.Стеллаж</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДобавления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДетали</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаботыСписок</name>
    <attributes>
      <name>Работа</name>
      <type>
        <types>CatalogRef.АвтоРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусРаботы</name>
      <type>
        <types>EnumRef.СостояниеВосстановленияДетали</types>
      </type>
    </attributes>
    <attributes>
      <name>Нормочас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНалог</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыполненияРабот</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрока</name>
      <comment>Для записи идентификатора в тип строка (для запроса)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиРодитель</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНорм</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Enums/СостояниеКомплектовки/СостояниеКомплектовки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеКомплектовки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Разнесено</name>
  </enumValues>
  <enumValues>
    <name>Предварительно</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Enums/СостоянияЗаказНаряда/СостоянияЗаказНаряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказНаряда</name>
  <enumValues>
    <name>Предварительный</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>НеПриехал</name>
  </enumValues>
  <enumValues>
    <name>Предварительно</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированаяЧастьЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/Documents/Рас_Комплектовка/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДиапазонПриИзменении(Элемент)
	// Комлев АА 19/12/24 ++++
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Диапазон.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Диапазон.ДатаОкончания);
	ЗаполнитьПодвалВостановленныеДетали();
	// Комлев АА 19/12/24 ----
КонецПроцедуры


&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	Аналитика.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 		ПериодОтчета.ДатаНачала);
	Аналитика.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	ПериодОтчета.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаАналитика Тогда
	Аналитика.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 		ПериодОтчета.ДатаНачала);
	Аналитика.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	ПериодОтчета.ДатаОкончания);
	ЗаполнитьПодвалАналитика();
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура ФильтрИсполнителиПриИзменении(Элемент)
	ФильтрИсполнителиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрИсполнителиПриИзмененииНаСервере()
	// Комлев АА 13/01/25 +++
	Аналитика.ПроизвольныйЗапрос = Истина;
	Если ФильтрИсполнители <> Справочники.Пользователи.ПустаяСсылка() Тогда
		ТекстЗапросаСУсловием = "ВЫБРАТЬ
		|	Рас_КомплектовкаРаботыСписок.Ссылка КАК Ссылка,
		|	СУММА(Рас_КомплектовкаРаботыСписок.Сумма) КАК СуммаРабот
		|ПОМЕСТИТЬ ВТ_СуммаРабот
		|ИЗ
		|	Документ.Рас_Комплектовка.РаботыСписок КАК Рас_КомплектовкаРаботыСписок
		|ГДЕ
		|	Рас_КомплектовкаРаботыСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	Рас_КомплектовкаРаботыСписок.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СуммаРабот.Ссылка КАК Ссылка,
		|	ВТ_СуммаРабот.СуммаРабот * 0.4 КАК ПроцентДиме
		|ПОМЕСТИТЬ ВТ_ПроцентДиме
		|ИЗ
		|	ВТ_СуммаРабот КАК ВТ_СуммаРабот
		|ГДЕ
		|	ВТ_СуммаРабот.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка КАК Ссылка,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата КАК Дата,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод КАК Инкод,
		|	СУММА(ВЫБОР
		|		КОГДА Рас_КомплектовкаНоменклатураСписок.Партия = Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод
		|			ТОГДА 0
		|		ИНАЧЕ Рас_КомплектовкаНоменклатураСписок.ЦенаДетали
		|	КОНЕЦ) КАК РемКомплект,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод.Владелец.РекомендованаяЦена КАК РекЦена
		|ПОМЕСТИТЬ ВТ_РемКомплект
		|ИЗ
		|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|ГДЕ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Рас_КомплектовкаНоменклатураСписок.Ссылка.Проведен
		|	И НЕ Рас_КомплектовкаНоменклатураСписок.Ссылка.ПометкаУдаления
		|	И Рас_КомплектовкаНоменклатураСписок.Ссылка.Состояние = Значение(Перечисление.СостояниеКомплектовки.Выполнено)
		|СГРУППИРОВАТЬ ПО
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод.Владелец.РекомендованаяЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемКомплект.Ссылка КАК Ссылка,
		|	ВТ_РемКомплект.Дата КАК Дата,
		|	ВТ_РемКомплект.Инкод КАК Инкод,
		|	ЕСТЬNULL(ВТ_РемКомплект.РемКомплект, 0) КАК РемКомплект,
		|	ЕСТЬNULL(ВТ_РемКомплект.РекЦена, 0) КАК РекЦена,
		|	ЕСТЬNULL(ВТ_СуммаРабот.СуммаРабот, 0) КАК СуммаРабот,
		|	ЕСТЬNULL(ВТ_ПроцентДиме.ПроцентДиме, 0) КАК ПроцентДиме,
		|	ЕСТЬNULL(ВТ_РемКомплект.РемКомплект, 0) + ЕСТЬNULL(ВТ_СуммаРабот.СуммаРабот, 0) +
		|		ЕСТЬNULL(ВТ_ПроцентДиме.ПроцентДиме, 0) КАК Себестоимость
		|ПОМЕСТИТЬ ВТ_Себестоимость
		|ИЗ
		|	ВТ_РемКомплект КАК ВТ_РемКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаРабот КАК ВТ_СуммаРабот
		|		ПО ВТ_РемКомплект.Ссылка = ВТ_СуммаРабот.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентДиме КАК ВТ_ПроцентДиме
		|		ПО ВТ_РемКомплект.Ссылка = ВТ_ПроцентДиме.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Себестоимость.Ссылка КАК Ссылка,
		|	ВТ_Себестоимость.Дата КАК Дата,
		|	ВТ_Себестоимость.Инкод КАК Инкод,
		|	ВТ_Себестоимость.РемКомплект КАК РемКомплект,
		|	ВТ_Себестоимость.РекЦена КАК РекЦена,
		|	ВТ_Себестоимость.СуммаРабот КАК СуммаРабот,
		|	ВТ_Себестоимость.ПроцентДиме КАК ПроцентДиме,
		|	ВТ_Себестоимость.Себестоимость КАК Себестоимость,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА ВТ_Себестоимость.Себестоимость <> 0
		|			ТОГДА (ВТ_Себестоимость.РекЦена / ВТ_Себестоимость.Себестоимость - 1) * 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(10, 2)) КАК НаценкаПроцент,
		|	ВТ_Себестоимость.РекЦена - ВТ_Себестоимость.Себестоимость КАК НаценкаВРублях
		|ИЗ
		|	ВТ_Себестоимость КАК ВТ_Себестоимость
		|ГДЕ
		|	ВТ_Себестоимость.Ссылка.Исполнители.Исполнитель = &Исполнитель";
		
		Аналитика.ТекстЗапроса = ТекстЗапросаСУсловием;
		Аналитика.Параметры.УстановитьЗначениеПараметра("Исполнитель", ФильтрИсполнители);
		
	Иначе
		
		Аналитика.ТекстЗапроса = "ВЫБРАТЬ
		|	Рас_КомплектовкаРаботыСписок.Ссылка КАК Ссылка,
		|	СУММА(Рас_КомплектовкаРаботыСписок.Сумма) КАК СуммаРабот
		|ПОМЕСТИТЬ ВТ_СуммаРабот
		|ИЗ
		|	Документ.Рас_Комплектовка.РаботыСписок КАК Рас_КомплектовкаРаботыСписок
		|ГДЕ
		|	Рас_КомплектовкаРаботыСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|СГРУППИРОВАТЬ ПО
		|	Рас_КомплектовкаРаботыСписок.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СуммаРабот.Ссылка КАК Ссылка,
		|	ВТ_СуммаРабот.СуммаРабот * 0.4 КАК ПроцентДиме
		|ПОМЕСТИТЬ ВТ_ПроцентДиме
		|ИЗ
		|	ВТ_СуммаРабот КАК ВТ_СуммаРабот
		|ГДЕ
		|	ВТ_СуммаРабот.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка КАК Ссылка,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата КАК Дата,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод КАК Инкод,
		|	СУММА(ВЫБОР
		|		КОГДА Рас_КомплектовкаНоменклатураСписок.Партия = Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод
		|			ТОГДА 0
		|		ИНАЧЕ Рас_КомплектовкаНоменклатураСписок.ЦенаДетали
		|	КОНЕЦ) КАК РемКомплект,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод.Владелец.РекомендованаяЦена КАК РекЦена
		|ПОМЕСТИТЬ ВТ_РемКомплект
		|ИЗ
		|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|ГДЕ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Рас_КомплектовкаНоменклатураСписок.Ссылка.Проведен
		|	И НЕ Рас_КомплектовкаНоменклатураСписок.Ссылка.ПометкаУдаления
		|	И Рас_КомплектовкаНоменклатураСписок.Ссылка.Состояние = Значение(Перечисление.СостояниеКомплектовки.Выполнено)
		|СГРУППИРОВАТЬ ПО
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата,
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Инкод.Владелец.РекомендованаяЦена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РемКомплект.Ссылка КАК Ссылка,
		|	ВТ_РемКомплект.Дата КАК Дата,
		|	ВТ_РемКомплект.Инкод КАК Инкод,
		|	ЕСТЬNULL(ВТ_РемКомплект.РемКомплект, 0) КАК РемКомплект,
		|	ЕСТЬNULL(ВТ_РемКомплект.РекЦена, 0) КАК РекЦена,
		|	ЕСТЬNULL(ВТ_СуммаРабот.СуммаРабот, 0) КАК СуммаРабот,
		|	ЕСТЬNULL(ВТ_ПроцентДиме.ПроцентДиме, 0) КАК ПроцентДиме,
		|	ЕСТЬNULL(ВТ_РемКомплект.РемКомплект, 0) + ЕСТЬNULL(ВТ_СуммаРабот.СуммаРабот, 0) +
		|		ЕСТЬNULL(ВТ_ПроцентДиме.ПроцентДиме, 0) КАК Себестоимость
		|ПОМЕСТИТЬ ВТ_Себестоимость
		|ИЗ
		|	ВТ_РемКомплект КАК ВТ_РемКомплект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаРабот КАК ВТ_СуммаРабот
		|		ПО ВТ_РемКомплект.Ссылка = ВТ_СуммаРабот.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроцентДиме КАК ВТ_ПроцентДиме
		|		ПО ВТ_РемКомплект.Ссылка = ВТ_ПроцентДиме.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Себестоимость.Ссылка КАК Ссылка,
		|	ВТ_Себестоимость.Дата КАК Дата,
		|	ВТ_Себестоимость.Инкод КАК Инкод,
		|	ВТ_Себестоимость.РемКомплект КАК РемКомплект,
		|	ВТ_Себестоимость.РекЦена КАК РекЦена,
		|	ВТ_Себестоимость.СуммаРабот КАК СуммаРабот,
		|	ВТ_Себестоимость.ПроцентДиме КАК ПроцентДиме,
		|	ВТ_Себестоимость.Себестоимость КАК Себестоимость,
		|	ВЫРАЗИТЬ(ВЫБОР
		|		КОГДА ВТ_Себестоимость.Себестоимость <> 0
		|			ТОГДА (ВТ_Себестоимость.РекЦена / ВТ_Себестоимость.Себестоимость - 1) * 100
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ЧИСЛО(10, 2)) КАК НаценкаПроцент,
		|	ВТ_Себестоимость.РекЦена - ВТ_Себестоимость.Себестоимость КАК НаценкаВРублях
		|ИЗ
		|	ВТ_Себестоимость КАК ВТ_Себестоимость";
		
	КонецЕсли;
	Элементы.Аналитика.Обновить();
	ЗаполнитьПодвалАналитика();
	// Комлев АА 13/01/25 ---
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ИнформацияОПроданныхИВостановленныхДеталях(Команда)
	ИнформацияОПроданныхИВостановленныхДеталяхНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИнформацияОПроданныхИВостановленныхДеталяхНаСервере()
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПодвалПроданныеДетали();
	
	// Комлев АА 19/12/24 ++++
	ЗаполнитьПодвалВостановленныеДетали();
	// Комлев АА 19/12/24 ----
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	///+ТатарМА 27.12.2024
	ТекСтрока = Элементы.Аналитика.ТекущиеДанные;
	Если Поле = Элементы.АналитикаСсылка Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Ссылка;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.Рас_Комплектовка.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///-ТатарМА 27.12.2024
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПроданныеДеталиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ТатарМА 19.09.2024
	ТекСтрока = Элементы.ПроданныеДетали.ТекущиеДанные;
	Если Поле = Элементы.ПроданныеДеталиЗаказНарядНаВосстановление Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.ЗаказНарядНаВосстановление;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.Рас_Комплектовка.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	ИначеЕсли Поле = Элементы.ПроданныеДеталиПродажа Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Продажа;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.ПродажаЗапчастей.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///-ТатарМА 19.09.2024

КонецПроцедуры

&НаКлиенте
Процедура ПериодВосстановлениеПриИзменении(Элемент)
	ПериодВосстановлениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПродажиПриИзменении(Элемент)
	ПериодПродажиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодВосстановлениеПриИзмененииНаСервере()
	
	///+ТатарМА 30.10.2024
	Если ПериодВосстановление.ДатаНачала = '00010101' Тогда

		ПроданныеДетали.ТекстЗапроса = "ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка КАК ЗаказНарядНаВосстановление,
		|	Рас_Комплектовка.Дата КАК ДатаВосстановления,
		|	Рас_Комплектовка.Инкод КАК Инкод,
		|	Рас_Комплектовка.Номенклатура КАК Товар,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена КАК РекомендованаяЦена,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Сумма КАК СуммаПродажи
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (Рас_Комплектовка.Инкод = ПродажаЗапчастейТаблица.Партия)
		|ГДЕ
		|	НЕ Рас_Комплектовка.Инкод = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ПродажаЗапчастейТаблица.СтатусТовара
		|	И НЕ ПродажаЗапчастейТаблица.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка,
		|	Рас_Комплектовка.Дата,
		|	Рас_Комплектовка.Инкод,
		|	Рас_Комплектовка.Номенклатура,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена,
		|	ЗаказНарядТовары.Ссылка.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Цена
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ПО (Рас_Комплектовка.Инкод = ЗаказНарядТовары.Партия)
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказНаряда.Выполнен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВосстановления УБЫВ";

	Иначе
		
		ПроданныеДетали.ТекстЗапроса = "ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка КАК ЗаказНарядНаВосстановление,
		|	Рас_Комплектовка.Дата КАК ДатаВосстановления,
		|	Рас_Комплектовка.Инкод КАК Инкод,
		|	Рас_Комплектовка.Номенклатура КАК Товар,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена КАК РекомендованаяЦена,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Сумма КАК СуммаПродажи
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (Рас_Комплектовка.Инкод = ПродажаЗапчастейТаблица.Партия)
		|ГДЕ
		|	НЕ Рас_Комплектовка.Инкод = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ПродажаЗапчастейТаблица.СтатусТовара
		|	И НЕ ПродажаЗапчастейТаблица.Отменено
		|	И Рас_Комплектовка.Дата МЕЖДУ &ДатаНачалаВос И &ДатаОкончанияВос
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка,
		|	Рас_Комплектовка.Дата,
		|	Рас_Комплектовка.Инкод,
		|	Рас_Комплектовка.Номенклатура,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена,
		|	ЗаказНарядТовары.Ссылка.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Цена
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ПО (Рас_Комплектовка.Инкод = ЗаказНарядТовары.Партия)
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказНаряда.Выполнен)
		|	И Рас_Комплектовка.Дата МЕЖДУ &ДатаНачалаВос И &ДатаОкончанияВос
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВосстановления УБЫВ";
		
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаНачалаВос", ПериодВосстановление.ДатаНачала);
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияВос", ПериодВосстановление.ДатаОкончания);
	КонецЕсли;

	ЗаполнитьПодвалПроданныеДетали();

	Элементы.Список.Обновить();
	///-ТатарМА 30.10.1024
	
КонецПроцедуры

&НаСервере
Процедура ПериодПродажиПриИзмененииНаСервере()
	
	///+ТатарМА 30.10.2024
	Если ПериодПродажи.ДатаНачала = '00010101' Тогда

		ПроданныеДетали.ТекстЗапроса = "ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка КАК ЗаказНарядНаВосстановление,
		|	Рас_Комплектовка.Дата КАК ДатаВосстановления,
		|	Рас_Комплектовка.Инкод КАК Инкод,
		|	Рас_Комплектовка.Номенклатура КАК Товар,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена КАК РекомендованаяЦена,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Сумма КАК СуммаПродажи
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (Рас_Комплектовка.Инкод = ПродажаЗапчастейТаблица.Партия)
		|ГДЕ
		|	НЕ Рас_Комплектовка.Инкод = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ПродажаЗапчастейТаблица.СтатусТовара
		|	И НЕ ПродажаЗапчастейТаблица.Отменено
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка,
		|	Рас_Комплектовка.Дата,
		|	Рас_Комплектовка.Инкод,
		|	Рас_Комплектовка.Номенклатура,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена,
		|	ЗаказНарядТовары.Ссылка.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Цена
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ПО (Рас_Комплектовка.Инкод = ЗаказНарядТовары.Партия)
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказНаряда.Выполнен)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВосстановления УБЫВ";

	Иначе
		ПроданныеДетали.ТекстЗапроса = "ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка КАК ЗаказНарядНаВосстановление,
		|	Рас_Комплектовка.Дата КАК ДатаВосстановления,
		|	Рас_Комплектовка.Инкод КАК Инкод,
		|	Рас_Комплектовка.Номенклатура КАК Товар,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена КАК РекомендованаяЦена,
		|	ПродажаЗапчастейТаблица.Ссылка.Ссылка КАК Продажа,
		|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаПродажи,
		|	ПродажаЗапчастейТаблица.Сумма КАК СуммаПродажи
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|		ПО (Рас_Комплектовка.Инкод = ПродажаЗапчастейТаблица.Партия)
		|ГДЕ
		|	НЕ Рас_Комплектовка.Инкод = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ПродажаЗапчастейТаблица.СтатусТовара
		|	И НЕ ПродажаЗапчастейТаблица.Отменено
		|	И ПродажаЗапчастейТаблица.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Ссылка,
		|	Рас_Комплектовка.Дата,
		|	Рас_Комплектовка.Инкод,
		|	Рас_Комплектовка.Номенклатура,
		|	Рас_Комплектовка.Номенклатура.РекомендованаяЦена,
		|	ЗаказНарядТовары.Ссылка.Ссылка,
		|	ЗаказНарядТовары.Ссылка.Дата,
		|	ЗаказНарядТовары.Цена
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|		ПО (Рас_Комплектовка.Инкод = ЗаказНарядТовары.Партия)
		|ГДЕ
		|	НЕ ЗаказНарядТовары.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
		|	И ЗаказНарядТовары.Ссылка.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияЗаказНаряда.Выполнен)
		|	И ЗаказНарядТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВосстановления УБЫВ";
		
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодПродажи.ДатаНачала);
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодПродажи.ДатаОкончания);
	КонецЕсли;

	ЗаполнитьПодвалПроданныеДетали();

	Элементы.Список.Обновить();
	///-ТатарМА 30.10.2024
	
	
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПриАктивизацииСтроки1(Элемент)

КонецПроцедуры





&НаКлиенте
Процедура РаботыПоПроданнымДеталямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 15.08.2023
	ТекСтрока = Элементы.РаботыПоПроданнымДеталям.ТекущиеДанные;
	Если Поле = Элементы.РаботыПоПроданнымДеталямДокумент Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Документ;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		= ПолучитьФорму("Документ.Рас_Комплектовка.ФормаОбъекта", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ГомзМА 15.08.2023
	
КонецПроцедуры

Процедура ЗаполнитьПодвалПроданныеДетали()
	
	///+ТатарМА 19.09.2024
	Схема = Элементы.ПроданныеДетали.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ПроданныеДетали.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиРекомендованаяЦена.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиСуммаПродажи.ГоризонтальноеПоложениеВПодвале      	= ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиРекомендованаяЦена.ТекстПодвала = Формат(Результат.Итог("РекомендованаяЦена"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиСуммаПродажи.ТекстПодвала      	= Формат(Результат.Итог("СуммаПродажи"),"ЧДЦ=0; ЧН=-"); 
	///-ТатарМА 19.09.2024
	
КонецПроцедуры

Процедура ЗаполнитьПодвалВостановленныеДетали()
	/// Комлев АА +++ 19/12/24 +++++
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип(
		"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ЭтотОбъект.ЭтаФорма.Элементы.РекомендованнаяЦена.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.РекомендованнаяЦена.ТекстПодвала = Формат(Результат.Итог("РекомендованнаяЦена"),"ЧДЦ=0; ЧН=-");
		/// Комлев АА  19/12/24----- 
КонецПроцедуры

Процедура ЗаполнитьПодвалАналитика()
	// Комлев АА 13/01/25 +++
	Схема = Элементы.Аналитика.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Аналитика.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип(
		"ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаРемКомплект.ТекстПодвала = Формат(Результат.Итог("РемКомплект"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаСуммаРабот.ТекстПодвала = Формат(Результат.Итог("СуммаРабот"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаПроцентДиме.ТекстПодвала = Формат(Результат.Итог("ПроцентДиме"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаРекЦена.ТекстПодвала = Формат(Результат.Итог("РекЦена"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаСебестоимость.ТекстПодвала = Формат(Результат.Итог("Себестоимость"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаНаценкаВРублях.ТекстПодвала = Формат(Результат.Итог("НаценкаВРублях"),"ЧДЦ=0; ЧН=-");
	// Комлев АА 13/01/25 ---
КонецПроцедуры
